list_ten = list(range(10, 60, 10))
print(list_ten)
#  a. Виведіть третій символ цього рядка.
print(list_ten[2])
#  b. виведіть передостанній символ цього рядка.
print(list_ten[-2])
#  с. виведіть перші п'ять символів цього рядка.
print(list_ten[:5])
#  d. виведіть весь рядок, крім двох останніх символів.
print(list_ten[:-2])
 # e. виведіть усі символи з парними індексами (вважаючи,
# що індексація починається з 0, тому символи виводяться починаючи з першого).
print(list_ten[::2])
#  f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
print(list_ten[1::2])
#  g. виведіть усі символи у зворотному порядку.
print(list_ten[::-1])
 # h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
print(list_ten[::-2])
 # i. виведіть довжину цього рядка.
print(len(list_ten))