#Першого дня спортсмен пробіг `x` кілометрів, а потім він щодня збільшував пробіг на 10% від попереднього
#значення. За цим числом `y` визначте номер дня, на який відстань спортсмена складе не менше `y` кілометрів.
#Програма отримує на вхід числа `x` та `y` і має вивести одне число - номер дня.

def data(a, b) -> int:
    k = 1
    while a < b:
        a = a * 1.1
        k = k + 1
    return k


x = int(input('Kilometers first day- '))
y = int(input('Kilometers after "y" days - '))
print(data(x, y))



